app/controllers/pages_controller.rb

SELECT "students".* FROM "students" WHERE "students"."name" = ?  [["name", "primero"]]
SELECT "students".* FROM "students"
---
  def landing
    if params[:query].present?
      @students = Student.where(name: params[:query])
    else
      @students = Student.all